Revit 2027 API
ExternalDataManagerDataItem Properties
The ExternalDataManagerDataItem type exposes the following members.
Properties
Name | Description
Count |  The count of the data item.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the data item.
Path |  The saved path of the data item.
PathType |  The path type of the saved path (e.g. "Absolute", "Relative", "Cloud").
ReferenceType |  The reference type of the data item (e.g. "Import", "Link", "Overlay", "Attachment").
Resolution |  The width and height of a image data item if applicable.
Size |  The file size (Bytes) of the data item if applicable.
Status |  The status of the data item.
Version |  The version of the data item.
Top
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace